{"submissions": [{"title": "[no-politics] Movies Monday 31/Jul/2023", "score": 0}, {"title": "I miss australia so bad", "score": 887}, {"title": "Are supermarkets deliberately raising prices in a cost of living crisis?", "score": 275}, {"title": "Robo-debt royal commission: Scott Morrison lashes out at ‘political lynching’, rejects commission findings", "score": 325}, {"title": "Why does anyone care about the logies?", "score": 1218}, {"title": "‘They will never be granted the visa in their lifetime’: the families waiting decades to settle parents in Australia", "score": 267}, {"title": "This stuff is better than crack and ice combined, go eat some", "score": 197}, {"title": "Coalition moves to reverse $40 JobSeeker lift, proposing lift to benefits cut-off instead", "score": 465}, {"title": "'Gold Logie' Changed to 'White Logie', to Ensure Sonia Kruger Doesn’t Feel Uncomfortable — The Shovel", "score": 277}, {"title": "It’s my fault for not travelling forward in time to respond to the message.", "score": 82}, {"title": "Kitchen benches are still killing young tradies — and we know how to stop it", "score": 373}, {"title": "Wife and kids were on point with my AFL Birthday Cake", "score": 176}, {"title": "NSW police use force against Indigenous Australians at drastically disproportionate levels, data shows", "score": 284}, {"title": "Scam alert ft. Disney +", "score": 91}, {"title": "Australian electric vehicle sales in first half of 2023 already higher than all of 2022, report says", "score": 234}, {"title": "Been very warm in Hobart this winter up until now. Finally got some snow on kunanyi/Mt Wellignton overnight", "score": 60}, {"title": "When your sporting patriotism spills over into painting your wargaming miniatures", "score": 72}, {"title": "Scott Morrison accuses the government of 'rank hypocrisy' over Robodebt criticism, defends report findings", "score": 26}, {"title": "What the actual fuck: Part 2", "score": 1836}, {"title": "Misty morning in the Scenic Rim", "score": 136}, {"title": "What's with all the aggressive dogs and their stupid owners lately??", "score": 27}, {"title": "Threats and promises - Labor issues a warning over any delay to its $40 per fortnight JobSeeker increase", "score": 14}, {"title": "Australian Space Agency reveals origin of space junk discovered on Green Head beach in Western Australia", "score": 24}, {"title": "In-spite of the failure of the \"outpatient-only\" care move for mental health in Australia and worldwide why have they still not considered a more balanced approach where it can co-exist with long-term inpatient care?", "score": 91}, {"title": "Aussie Greyhound Trainer in Cruelty Case Once ‘Sexually Stimulated’ Dog", "score": 7}, {"title": "This mob of freeloaders taking up prime beach-front real estate at Maloneys Beach...", "score": 332}, {"title": "ABC science week. Vote for your favourite Australian animal sounds", "score": 9}, {"title": "Anyone notice so many natural gas ads?", "score": 5}, {"title": "US military analysts to embed in Australia's defence department to monitor regional threats in wake of AUSMIN talks", "score": 25}, {"title": "Have smoking rates been impacted by cost of living increases?", "score": 296}, {"title": "12 week jury duty on probation period - Any suggestion for excuse?", "score": 18}, {"title": "Is this legal under Fair Work?", "score": 5}, {"title": "Tips on where to travel?", "score": 2}, {"title": "I really miss Breaka (or really ANY Australian) chocolate milk", "score": 2}, {"title": "Dash Cam Owners Australia July 2023 On the Road Compilation", "score": 22}, {"title": "Why is personal data of Australians treated so poorly by Australian businesses?", "score": 2}, {"title": "Think I'll pay the regular price if it's all the same, thanks Woolies!", "score": 2}, {"title": "Trial for four people accused of murdering Indigenous schoolboy Cassius Turvey set for 2025", "score": 8}, {"title": "Anyone had a call from a strange caller ID?", "score": 1}, {"title": "World Swimming championships 2023: Australia loses team award to America over stupid detail", "score": 8}, {"title": "Does anyone remember (or still have) old VHS tapes from Movie Master, which sold Romanian cartoons (dubbed into English) in Australia in the 1990 like: The Adventures of Pin-Pin, Gore & Gregore, The Last Assignment, Tom the Nasty Cat, He who laughs last?", "score": 3}, {"title": "SA Premier eyes hydrogen for home gas connections", "score": 3}, {"title": "ADF has 108 evangelical chaplains with each representing just 15 members | Australian military", "score": 946}, {"title": "A weekend camping at NSW’s Central Coast", "score": 254}, {"title": "Flight from Brisbane to Indonesia forced to divert to Darwin after three men allegedly became disruptive, drank duty-free alcohol and vaped on-board", "score": 565}, {"title": "What to do if an Aramex delivery is marked and signed as “delivered” yet I haven’t received anything, I’ve waited a month for this.", "score": 1}, {"title": "Wollongong professor Justin Yerbury dies from motor neurone disease", "score": 106}, {"title": "Jobseeker to rise by $56 a fortnight but Albanese government unlikely to offer further boost. The welfare payment’s September rise includes an already announced $40 increase plus 2.2% indexation", "score": 351}, {"title": "Wallabies in the backyard - Scenic Rim, SEQ", "score": 141}, {"title": "Lease is ending in 90 days and Landlord wants us to pay last 3 payments at once", "score": 0}]}